---
kind: method
id: M:Autodesk.Revit.DB.Document.GetUnits
zh: 文档、文件
source: html/9ed56178-e9ae-b4bc-1c0e-e6a867ae3557.htm
---
# Autodesk.Revit.DB.Document.GetUnits Method

**中文**: 文档、文件

Gets the Units object.

## Syntax (C#)
```csharp
public Units GetUnits()
```

## Returns
The Units object.